Haobot/VoiceStickPlus/firmware/spikes/xiaomi_gateway_poc/sdkconfig.defaults
# Spike 专用配置：与主固件同形（esp32s3 + USB_SERIAL_JTAG 控制台 + OTA 分区表），
# 差异仅在 BLE 角色配平（central/observer）与连接数余量，验证后随项目目录整体废弃。
CONFIG_IDF_TARGET="esp32s3"

# 控制台：与主固件一致走 USB JTAG/Serial，串口监视工具链零适配
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# BLE：NimBLE 主机，spike 为主机（central/observer）角色
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y

# 连接/bond 余量：1 条对小米 + 重试期余量；bond 覆盖多轮测试
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_MAX_BONDS=4
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=6144

# 沿用主固件 OTA 分区表：烧录只替换 app 镜像，不动分区布局，便于验证后恢复正式固件
# （分区表按 8MB flash 布局，StickS3 硬件 flash 即 8MB，与主固件 sdkconfig 对齐）
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

CONFIG_MAIN_TASK_STACK_SIZE=8192
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
